<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title></title>
</head>
  <body background="optgeo.gif">
   <font color="#000099"><u><b><big><big>Lentille mince paraxiale</big></big></b></u></font><br>
       
<hr width="100%" size="2"><img src="lmcgrand.gif" alt="" width="100"
 height="100">
 &nbsp;   ou &nbsp;<img src="lmdgrand.gif" alt="" width="100"
 height="100">
   &nbsp; (convergente ou divergente)<br>
       
<hr width="100%" size="2"><br>
    <font color="#cc0000"><u><b><big>D&eacute;finition</big></b></u></font><br>
    <br>
    Elle est d&eacute;finie par les points 1 et 2 et le foyer F (ou F', peu 
importe) (ou la focale f'). <br>
    <br>
    La lentille peut &ecirc;tre ajout&eacute;e:<br>
    - en cliquant sur le bouton de la barre d'outil ayant la forme ci-dessus,
  puis en faisant un clic simple pour saisir le premier point, puis en faisant
  un clic simple pour saisir le second (ne pas maintenir le bouton de la
souris   enfonc&eacute; entre les deux points), puis un dernier clic pour
saisir la position du foyer.<br>
    OU<br>
    - menu "Ajouter" puis "Syst&egrave;me optique id&eacute;al" puis "Lentille 
mince convergente" ou "Lentille mince divergente". On donne alors les coordonn&eacute;es 
des points 1 et 2, puis la valeur de la focale.<br>
       
<hr width="100%" size="2"><br>
    <font color="#33ff33"><u><b><big>Options</big></b></u></font><br>
    <br>
    On peut imposer <br>
   - que l'axe focal soit trac&eacute; ou non<br>
    -l'&eacute;paisseur et la couleur du trait repr&eacute;sentant la lentille 
 &agrave; l'&eacute;cran<br>
   -  la couleur du trait repr&eacute;sentant l'axe focal &agrave; l'&eacute;cran<br>
    <br>
 <br>
    Ces propri&eacute;t&eacute;s peuvent &ecirc;tre rendues accessibles:<br>
    - &agrave; la construction du miroir si on passe par le menu "Ajouter"<br>
    - &agrave; tout instant en cliquant sur le bouton "Propri&eacute;t&eacute;s" 
 de la barre d'outil, puis en cliquant sur un des cercles bleus qui apparaissent 
 sur l'&eacute;l&eacute;ment dont on veut obtenir les propri&eacute;t&eacute;s; 
 ne pas oublier &agrave; la fin de cliquer sur le bouton "Fin prop." de la 
 barre d'outil pour quitter le mode propri&eacute;t&eacute;s.<br>
       
<hr width="100%" size="2"><u><b><big>Divers</big></b></u><br>
    <br>
   Comme la lentille est repr&eacute;sent&eacute;e &agrave; l'&eacute;cran 
par  son sch&eacute;ma conventionnel plan, les normales et angles ne peuvent 
&ecirc;tre  affich&eacute;s sur sa surface. Comme c'est une id&eacute;alisation 
d'une lentille r&eacute;elle, les surfaces d'onde issues d'une source ponctuelle 
 ou plane ne pourront &ecirc;tre trac&eacute;es si une telle lentille fait 
partie  de la simulation.<br>
 A noter que les rayons suivent les r&eacute;gles habituelles de trac&eacute; 
des lentilles minces, m&ecirc;me s'ils ne sont pas paraxiaux...<br>
       
<hr width="100%" size="2"><a href="Optgeo.html">Retour  &agrave; la page
&nbsp;d'accueil</a><br>
    <br>
    <br>
    <br>
   <br>
   <br>
 <br>
 <br>
</body>
</html>
