<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title></title>
</head>
  <body background="optgeo.gif">
  <font color="#000099"><u><b><big><big>Miroir parabolique, elliptique, ou
 hyperbolique</big></big></b></u></font><u><b>(concave ou convexe)</b></u><br>
     
<hr width="100%" size="2">&nbsp; <br>
   <br>
  <img src="coniquegrand.gif" alt="" width="294" height="212">
  <br>
   
<hr width="100%" size="2"><br>
   <font color="#cc0000"><u><b><big>D&eacute;finition</big></b></u></font><br>
   <br>
   Il est d&eacute;fini par les points 1 et 2 (extr&eacute;mit&eacute;s du
 miroir), le foyer F, et le sommet S. <br>
   <br>
   Le miroir peut &ecirc;tre ajout&eacute;:<br>
   - en cliquant sur le bouton de la barre d'outil ayant la forme du miroir
 conique (concave ou convexe), puis en faisant un clic simple pour saisir
le&nbsp; point 1, puis en faisant un clic simple pour saisir le foyer,&nbsp;puis
en faisant un clic simple pour saisir lesommet,&nbsp;puis en faisant un clic
 simple pour saisir le point 2 (ne pas maintenir le bouton de la souris enfonc&eacute;
 entre les deux points)<br>
   OU<br>
   - menu "Ajouter" puis "Syst&egrave;me optique r&eacute;el" puis "Miroir
 c&ocirc;nique ". Dans ce cas, on d&eacute;finit le miroir par les coordonn&eacute;es
 de F, l'angle polaire de l'axe focal (angle entre Fx et FS, compt&eacute;
 positif dans le sens antihoraire), les angles polaires de FM1 et FM2 (M1
et M2 &eacute;tant les extr&eacute;mit&eacute;s du miroir), le param&eacute;tre
 de la conique, et son excentricit&eacute;. On &nbsp;donne aussi le caract&egrave;re
 concave ou convexe du miroir.<br>
     
<hr width="100%" size="2"><br>
   <font color="#33ff33"><u><b><big>Options</big></b></u></font><br>
   <br>
   On peut imposer <br>
   -que les hachures soient trac&eacute;es ou non &agrave; l'&eacute;cran<br>
   -l'&eacute;paisseur et la couleur du trait repr&eacute;sentant le miroir 
 &agrave; l'&eacute;cran<br>
  - que l'axe focal soit trac&eacute; ou pas &agrave; l'&eacute;cran entre
 F et S<br>
  - la couleur de l'axe focal &agrave; l'&eacute;cran<br>
   <br>
   Ces propri&eacute;t&eacute;s peuvent &ecirc;tre rendues accessibles:<br>
   - &agrave; la construction du miroir si on passe par le menu "Ajouter"<br>
   - &agrave; tout instant en cliquant sur le bouton "Propri&eacute;t&eacute;s" 
 de la barre d'outil, puis en cliquant sur un des cercles bleus qui apparaissent 
 sur l'&eacute;l&eacute;ment dont on veut obtenir les propri&eacute;t&eacute;s; 
 ne pas oublier &agrave; la fin de cliquer sur le bouton "Fin prop." de la 
 barre d'outil pour quitter le mode propri&eacute;t&eacute;s.<br>
     
<hr width="100%" size="2"><u><b><big>Divers</big></b></u><br>
   <br>
   On peut demander que la normale au miroir soit trac&eacute;e &agrave;
chaque  point d'intersection d'un rayon lumineux avec ce miroir:<br>
   - menu "Options", v&eacute;rifier que "Afficher les normales" est coch&eacute;<br>
   OU<br>
   - dans la barre d'outil, boite &agrave; cocher "Normales"<br>
   <br>
   On peut aussi demander que les angles d'incidence soient affich&eacute;s 
 (en &deg;):<br>
   - menu "Options", v&eacute;rifier que "Afficher les angles" est coch&eacute;<br>
   OU<br>
   - dans la barre d'outil, boite &agrave; cocher "Angles d'incidence et
de  r&eacute;fraction"<br>
   L'angle de r&eacute;flexion n'est pas affich&eacute;, afin de ne pas surcharger 
 les repr&eacute;sentations.<br>
   <br>
   Le nombre de &nbsp;d&eacute;cimales sur les angles est fix&eacute; dans
 la boite de dialogue des options des normales: menu "Options" puis "Options 
 des normales"<br>
     
<hr width="100%" size="2"><a href="Optgeo.html">Retour  &agrave; la page
&nbsp;d'accueil</a><br>
   <br>
   <br>
  <br>
  <br>
 <br>
</body>
</html>
