<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title></title>
</head>
  <body background="optgeo.gif">
   <font color="#000099"><u><b><big><big>Miroir sph&eacute;rique paraxial</big></big></b></u></font> 
 <b><u>(trou&eacute; on non)</u></b><br>
       
<hr width="100%" size="2"><img src="mscopagrand.gif" alt="" width="100"
 height="100">
    ou &nbsp;<img src="mscepagrand.gif" alt="" width="100" height="100">
   &nbsp; (concave ou convexe)<br>
       
<hr width="100%" size="2"><br>
    <font color="#cc0000"><u><b><big>D&eacute;finition</big></b></u></font><br>
    <br>
    Il est d&eacute;fini par les points 1 et 2 et le foyer F (ou la focale
 f'). L'ordre des&nbsp; points 1 et 2 est important, car il d&eacute;finit
 quelle est la face r&eacute;fl&eacute;chissante, l'autre &eacute;tant absorbante,
  comme sur l'image ci-dessus.<br>
    <br>
    Le miroir peut &ecirc;tre ajout&eacute;:<br>
    - en cliquant sur le bouton de la barre d'outil ayant la forme ci-dessus,
  puis en faisant un clic simple pour saisir le premier point, puis en faisant
  un clic simple pour saisir le second (ne pas maintenir le bouton de la
souris   enfonc&eacute; entre les deux points), puis un dernier clic pour
saisir la position du foyer<br>
    OU<br>
    - menu "Ajouter" puis "Syst&egrave;me optique id&eacute;al" puis "Miroir 
 sph&eacute;rique concave" ou "Miroir sph&eacute;rique convexe". On donne 
alors les coordonn&eacute;es des points 1 et 2, puis la valeur de la focale.<br>
       
<hr width="100%" size="2"><br>
    <font color="#33ff33"><u><b><big>Options</big></b></u></font><br>
    <br>
    On peut imposer <br>
    -que les hachures soient trac&eacute;es ou non &agrave; l'&eacute;cran<br>
   - que l'axe focal soit trac&eacute; ou non<br>
    -l'&eacute;paisseur et la couleur du trait repr&eacute;sentant le miroir 
 &agrave; l'&eacute;cran<br>
   -  la couleur du trait repr&eacute;sentant l'axe focal &agrave; l'&eacute;cran<br>
    <br>
   On peut aussi choisir de<i><b> trouer le miroir en son centre</b></i>
(pratique  par exemple pour les t&eacute;lescopes de type Cassegrain).<br>
   <br>
    Ces propri&eacute;t&eacute;s peuvent &ecirc;tre rendues accessibles:<br>
    - &agrave; la construction du miroir si on passe par le menu "Ajouter"<br>
    - &agrave; tout instant en cliquant sur le bouton "Propri&eacute;t&eacute;s" 
 de la barre d'outil, puis en cliquant sur un des cercles bleus qui apparaissent 
 sur l'&eacute;l&eacute;ment dont on veut obtenir les propri&eacute;t&eacute;s; 
 ne pas oublier &agrave; la fin de cliquer sur le bouton "Fin prop." de la 
 barre d'outil pour quitter le mode propri&eacute;t&eacute;s.<br>
       
<hr width="100%" size="2"><u><b><big>Divers</big></b></u><br>
    <br>
   Comme le miroir est repr&eacute;sent&eacute; &agrave; l'&eacute;cran par 
 son sch&eacute;ma conventionnel plan, les normales et angles ne peuvent &ecirc;tre
 affich&eacute;s sur sa surface. Comme c'est une id&eacute;alisation du miroir
 sph&eacute;rique r&eacute;el, les surfaces d'onde issues d'une source ponctuelle
 ou plane ne pourront &ecirc;tre trac&eacute;es si un tel miroir fait partie
 de la simulation.<br>
       
<hr width="100%" size="2"><a href="Optgeo.html">Retour  &agrave; la page
&nbsp;d'accueil</a><br>
    <br>
    <br>
    <br>
   <br>
   <br>
  <br>
 <br>
</body>
</html>
