<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title></title>
</head>
  <body background="optgeo.gif">
        <font color="#000099"><u><b><big><big>Polyg&ocirc;ne r&eacute;fractant</big></big></b></u></font>
  <u><b>(dont: prisme, lame &agrave; faces parall&egrave;les, etc...)</b></u><br>
                  
<hr width="100%" size="2">&nbsp; &nbsp; <img src="polyhedregrand.gif"
 alt="" width="100" height="100">
      <br>
                  
<hr width="100%" size="2"><br>
          <font color="#cc0000"><u><b><big>D&eacute;finition</big></b></u></font><br>
          <br>
          Il est d&eacute;fini par les sommets 1, 2, 3..., et par les indices 
  de r&eacute;fraction. <br>
          Le polyg&ocirc;ne doit &ecirc;tre connexe (il ne doit pas y avoir 
 d'intersection entre cot&eacute;s non cons&eacute;cutifs); le logiciel v&eacute;rifie 
 cette condition de connexit&eacute;.<br>
          Le polyg&ocirc;ne peut &ecirc;tre ajout&eacute;:<br>
          - en cliquant sur le bouton de la barre d'outil ayant la forme
ci-dessus,     puis en choisissant le nombre de sommets via une bo&icirc;te
de dialogue,   puis en faisant un clic simple pour saisir chacun des sommets
(ne pas maintenir   le bouton de la souris appuy&eacute; entre deux points).<br>
          OU<br>
          - menu "Ajouter" puis "Syst&egrave;me optique r&eacute;el" puis 
"Polyg&ocirc;ne   r&eacute;fractant". On donne alors le nombre de sommets, 
puis les coordonn&eacute;es   des sommets.<br>
                  
<hr width="100%" size="2"><br>
          <font color="#33ff33"><u><b><big>Options</big></b></u></font><br>
          <br>
          On peut imposer <br>
          - la couleur &agrave; l'&eacute;cran du polyg&ocirc;ne<br>
         -  les indices de r&eacute;fraction dans le bleu, le vert et le
rouge;    par d&eacute;faut, les valeurs 1,8, 1,6 et 1,4 sont attribu&eacute;es. 
On peut aussi choisir directement un mat&eacute;riau dans une liste qui comprend 
quelques verres, l'eau, et des plastiques optiques. Plus pr&eacute;cis&eacute;ment, 
les indices sont donn&eacute;s pour les longueurs d'onde de r&eacute;f&eacute;rence 
suivantes: 486,1nm, 587,6nm et 656,3nm. Pour modifier la liste des &eacute;l&eacute;ments 
propos&eacute;s, <a href="Materiaux.html">cliquer ici.</a><br>
      - les conditions d'existence d'un rayon r&eacute;fl&eacute;chi, dans
 le  sens entrant et dans le sens sortant; le rayon r&eacute;fl&eacute;chi
 peut  exister "toujours", "jamais", "seulement si le r&eacute;fract&eacute;
 existe",  "seulement si le r&eacute;fract&eacute; n'existe pas". &nbsp;Lorsqu'il
 y a &agrave; la fois un rayon transmis et un rayon r&eacute;fl&eacute;chi, 
 le rayon r&eacute;fl&eacute;chi est un "rayon enfant", terminologie utilis&eacute;e 
  dans la d&eacute;finition du<a href="rayon.html"> rayon unique</a>, de la
<a href="sponct.html">source  ponctuelle</a>, et de <a href="op.html">l'onde
 plane</a>.<br>
          <br>
       <br>
          Ces propri&eacute;t&eacute;s peuvent &ecirc;tre rendues accessibles:<br>
          - &agrave; la construction de la sph&egrave;re si on passe par
le  menu  "Ajouter"<br>
          - &agrave; tout instant en cliquant sur le bouton "Propri&eacute;t&eacute;s"
    de la barre d'outil, puis en cliquant sur un des cercles bleus qui apparaissent
    sur l'&eacute;l&eacute;ment dont on veut obtenir les propri&eacute;t&eacute;s;
    ne pas oublier &agrave; la fin de cliquer sur le bouton "Fin prop." de
 la   barre d'outil pour quitter le mode propri&eacute;t&eacute;s.<br>
                  
<hr width="100%" size="2"><u><b><big>Divers</big></b></u><br>
          <br>
        On peut demander que la normale au miroir soit trac&eacute;e &agrave; 
  chaque  point d'intersection d'un rayon lumineux avec ce polyg&ocirc;ne:<br>
        - menu "Options", v&eacute;rifier que "Afficher les normales" est 
coch&eacute;<br>
        OU<br>
        - dans la barre d'outil, boite &agrave; cocher "Normales"<br>
        <br>
        On peut aussi demander que les angles d'incidence et de r&eacute;fraction
   soient affich&eacute;s  (en &deg;):<br>
        - menu "Options", v&eacute;rifier que "Afficher les angles" est coch&eacute;<br>
        OU<br>
        - dans la barre d'outil, boite &agrave; cocher "Angles d'incidence
 et  de  r&eacute;fraction"<br>
        L'angle de r&eacute;flexion n'est pas affich&eacute;, afin de ne
pas   surcharger   les repr&eacute;sentations.<br>
        <br>
        Le nombre de &nbsp;d&eacute;cimales sur les angles est fix&eacute;
 dans   la boite de dialogue des options des normales: menu "Options" puis
 "Options    des normales"<br>
                  
<hr width="100%" size="2"><a href="Optgeo.html">Retour    &agrave; la page
 &nbsp;d'accueil</a><br>
          <br>
          <br>
          <br>
         <br>
         <br>
       <br>
      <br>
     <br>
     <br>
    <br>
   <br>
  <br>
 <br>
</body>
</html>
